### Top 10 country ratio versus the rest of the world

In [38]:
import pandas as pd

In [39]:
# assign the country csv file to a variable
path = ('../clean_data/country_population_change_2yrs.csv')

# read the csv file
countries_vs_world = pd.read_csv(path, index_col=0)
countries_vs_world

,Country,2019,2020,Area_(km²),Growth_Rate_(%),World_Ratio_(%)
Rank,,,,,,
1,China,1433783686,1442166775,9706961,0.39,18.47
2,India,1366417754,1387177258,3287590,0.99,17.70
3,United States,329064917,332041150,9372610,0.59,4.25
4,Indonesia,270625568,275056196,1904569,1.07,3.51
5,Pakistan,216565318,223154088,881912,2.00,2.83
...,...,...,...,...,...,...
228,Montserrat,4989,4992,102,0.06,0.00
229,Falkland Islands,3377,3480,12173,3.05,0.00
230,Niue,1615,1626,260,0.68,0.00
231,Tokelau,1340,1357,12,1.27,0.00
232,Vatican City,799,801,1,0.25,0.00

In [40]:
# grab the top 10 countries
top_10 = countries_vs_world.head(10)
top_10

,Country,2019,2020,Area_(km²),Growth_Rate_(%),World_Ratio_(%)
Rank,,,,,,
1,China,1433783686,1442166775,9706961,0.39,18.47
2,India,1366417754,1387177258,3287590,0.99,17.70
3,United States,329064917,332041150,9372610,0.59,4.25
4,Indonesia,270625568,275056196,1904569,1.07,3.51
5,Pakistan,216565318,223154088,881912,2.00,2.83
6,Brazil,211049527,213344896,8515767,0.72,2.73
7,Nigeria,200963599,208873242,923768,2.58,2.64
8,Bangladesh,163046161,165549495,147570,1.01,2.11
9,Russia,145872256,145960882,17098242,0.04,1.87
10,Mexico,127575529,129649385,1964375,1.06,1.65

In [41]:
# delete unecessary columns
del top_10['2019'], top_10['Area_(km²)'], top_10['Growth_Rate_(%)']
top_10

            Country        2020  World_Ratio_(%)
Rank
1             China  1442166775            18.47
2             India  1387177258            17.70
3     United States   332041150             4.25
4         Indonesia   275056196             3.51
5          Pakistan   223154088             2.83
6            Brazil   213344896             2.73
7           Nigeria   208873242             2.64
8        Bangladesh   165549495             2.11
9            Russia   145960882             1.87
10           Mexico   129649385             1.65

In [42]:
# sum of the world ratio of the top 10 countries
print(top_10['World_Ratio_(%)'].sum(axis=0))

57.76

In [43]:
# grab the remaining countries
rest_of_the_world = countries_vs_world.tail(222)
rest_of_the_world

,Country,2019,2020,Area_(km²),Growth_Rate_(%),World_Ratio_(%)
Rank,,,,,,
11,Japan,126860301,126275125,377930,-0.30,1.62
12,Ethiopia,112078730,116483634,1104300,2.57,1.47
13,Philippines,108116615,110360579,342353,1.35,1.41
14,Egypt,100388073,103358053,1002450,1.94,1.31
15,Vietnam,96462106,97793127,331212,0.91,1.25
...,...,...,...,...,...,...
228,Montserrat,4989,4992,102,0.06,0.00
229,Falkland Islands,3377,3480,12173,3.05,0.00
230,Niue,1615,1626,260,0.68,0.00
231,Tokelau,1340,1357,12,1.27,0.00
232,Vatican City,799,801,1,0.25,0.00

In [44]:
# delete unecessary columns
del rest_of_the_world['2019'], rest_of_the_world['Area_(km²)'], rest_of_the_world['Growth_Rate_(%)']
rest_of_the_world

               Country       2020  World_Ratio_(%)
Rank
11               Japan  126275125             1.62
12            Ethiopia  116483634             1.47
13         Philippines  110360579             1.41
14               Egypt  103358053             1.31
15             Vietnam   97793127             1.25
...                ...        ...              ...
228         Montserrat       4992             0.00
229   Falkland Islands       3480             0.00
230               Niue       1626             0.00
231            Tokelau       1357             0.00
232       Vatican City        801             0.00

[222 rows x 3 columns]

In [45]:
# population of the rest of the world from rank 11
rest_of_the_world_sum = rest_of_the_world['2020'].sum(axis=0)
print(rest_of_the_world_sum)

3314375271

In [46]:
# rest of the world ratio from rank 11
rest_of_the_world_ratio = 100 - top_10['World_Ratio_(%)'].sum(axis=0)
print(rest_of_the_world_ratio)

42.24

In [47]:
# add a new row the the rest of the world data
new_row = {'Country':'Rest of the World', '2020':rest_of_the_world_sum, 'World_Ratio_(%)':rest_of_the_world_ratio}
population_ratio = top_10.append(new_row, ignore_index=True)

#append row to the dataframe
population_ratio

              Country        2020  World_Ratio_(%)
0               China  1442166775            18.47
1               India  1387177258            17.70
2       United States   332041150             4.25
3           Indonesia   275056196             3.51
4            Pakistan   223154088             2.83
5              Brazil   213344896             2.73
6             Nigeria   208873242             2.64
7          Bangladesh   165549495             2.11
8              Russia   145960882             1.87
9              Mexico   129649385             1.65
10  Rest of the World  3314375271            42.24

In [48]:
# set the Country as the index
population_ratio.set_index("Country", inplace = True)
population_ratio

                         2020  World_Ratio_(%)
Country
China              1442166775            18.47
India              1387177258            17.70
United States       332041150             4.25
Indonesia           275056196             3.51
Pakistan            223154088             2.83
Brazil              213344896             2.73
Nigeria             208873242             2.64
Bangladesh          165549495             2.11
Russia              145960882             1.87
Mexico              129649385             1.65
Rest of the World  3314375271            42.24

In [49]:
# export the population_ratio to a csv file
population_ratio.to_csv("../clean_data/top10_country_population_ratio.csv")